<?php

namespace App\Http\Controllers;

use App\Http\Controllers\Controller;
use App\Models\Cart;
use Illuminate\Http\Request;
use App\Http\Soap\WSSoapShev;
use App\Libraries\Payment\CartPayment;
use App\Libraries\Payment\UpgradePayment;
use App\Libraries\Payment\PayNowPayment;

class PaymentController extends Controller
{
    public function __construct()
    {
        # Code...
    }

    public function index()
    {
        return view('website.payment.index');
    }

    /**
     * [pay description]
     * @return [type] [description]
     */
    public function pay()
    {
        date_default_timezone_set('Asia/Jerusalem');

        $sdata = [
            'userName' => "solelsite",
            'password' => "GG3fVm4Q",
            'termNo' => "5780498",
            'OrderID' => date("Hi"),
            'DomainName' => session('payfor_domain'),
            'total' =>  session('payfor_total'),
        ];

        return view('website.payment.pay', ['sdata' => $sdata]);
    }

    public function goodUrl(Request $request)
    {
        $classes = [
            'cart' => CartPayment::class,
            'upgrade' => UpgradePayment::class,
            'payNow' => PayNowPayment::class,
        ];

        $classes[session('payfor_type')]::perform($request);

        return view('website.payment.good', ['result' => $request->result]);
    }

    /**
     * [errorUrl description]
     * @param  Request $request [description]
     * @return [type]           [description]
     */
    public function errorUrl(Request $request)
    {
        $result = $this->reason($request->result);

        return view('website.payment.error', ['errorCode' => !empty($request->result) ? $request->result: '000', 'errorMsg' => $result]);
    }

    private function reason($result)
    {
        $reason = substr($result, 0, 3);

        $err = [
            "001" => "חסום החרם כרטיס",
            "002" => "גנוב החרם כרטיס",
            "003" => "התקשר לחברת האשראי",
            "004" => "סירוב",
            "005" => "מזויף החרם כרטיס",
            "006" => "חובה להתקשר לחברת האשראי",
            "009" => "לא הצליח להתקשר",
            "010" => 'תוכנית הופסקה עפ"י הוראת המפעיל (ESC) או COM PORT לא ניתן לפתיחה (WINDOWS)',
            "011" => "אין אישור סולק למטבע איזו",
            "012" => "אין אישור למותג למטבע איזו",
            "014" => "כרטיס לא נתמך",
            "015" => "אין התאמה בין המספר שהוקלד לפס המגנטי",
            "016" => "נתונים נוספים אינם או ישנם בניגוד להגדרות המסוף",
            "017" => "לא הוקלדו 4 ספרות האחרונות",
            "019" => "רשומה בקובץ INT_IN קצרה מ- 16 תווים",
            "020" => "קובץ קלט (IN_INT) לא קיים",
            "021" => "קובץ חסומים (NEG) לא קיים או לא מעודכן - בצע שידור או בקשה לאישור עבור כל עסקה",
            "022" => "אחד מקבצי פרמטרים או ווקטורים לא קיים",
            "023" => "קובץ תאריכים (DATA) לא קיים",
            "024" => "קובץ אתחול (START) לא קיים",
            "025" => "הפרש בימים בקליטת חסומים גדול מדי - בצע שידור או בקשה לאישור עבור כל עסקה",
            "026" => "הפרש דורות בקליטת חסומים גדול מידי - בצע שידור או בקשה לאישור עבור כל עסקה",
            "027" => "כאשר לא הוכנס פס מגנטי כולו הגדר עסקה כעסקה טלפונית או כעסקת חתימה בלבד",
            "028" => "מספר מסוף מרכזי לא הוכנס למסוף המוגדר לעבודה כרב ספק",
            "029" => "מספר מוטב לא הוכנס למסוף המוגדר לעבודה כרב מוטב",
            "030" => "מסוף שאינו מעודכן כרב ספק/רב מוטב והוקלד מס' ספק/מס' מוטב",
            "031" => "מסוף מעודכן כרב ספק והוקלד גם מס' מוטב",
            "032" => "תנועות ישנות בצע שידור או בקשה לאישור עבור כל עסקה",
            "033" => "כרטיס לא תקין",
            "034" => "כרטיס לא רשאי לבצע במסוף זה או אין אישור לעסקה כזאת",
            "035" => "כרטיס לא רשאי לבצע עסקה עם סוג אשראי זה",
            "036" => "פג תוקף",
            "037" => "שגיאה בתשלומים-סכום עסקה צריך להיות שווה תשלום ראשון + (תשלום קבוע כפול מס' תשלומים)",
            "038" => "לא ניתן לבצע עסקה מעל תקרה לכרטיס לאשראי חיוב מיידי",
            "039" => "סיפרת בקורת לא תקינה",
            "040" => "מסוף שמוגדר כרב מוטב הוקלד מס' ספק",
            "058" => "לא הוקלד CVV2",
            "059" => "לא הוקלדו מספר תעודת הזהות ו – CVV2 ",
            "061" => "מספר כרטיס לא נמצא או נמצא פעמיים",
            "062" => "סוג עסקה לא תקין",
            "063" => "קוד עסקה לא תקין",
            "064" => "סוג אשראי לא תקין",
            "066" => "קיים תשלום ראשון ו/או תשלום קבוע לסוג אשראי שונה מתשלומים",
            "067" => "קיים מספר תשלומים לסוג אשראי שאינו דורש זה",
            "068" => "לא ניתן להצמיד לדולר או למדד לסוג אשראי שונה מתשלומים",
            "069" => "אורך הפס המגנטי קצר מידי",
            "070" => "לא מוגדר מכשיר להקשת מספר סודי",
            "071" => "חובה להקליד מספר סודי",
            "074" => "דחייה – כרטיס נעול",
            "077" => "הוקלד מספר סודי שגוי",
            "092" => "עסקת ביטול אסורה בכרטיס יש לבצע עסקת זיכוי",
            "111" => "למסוף אין אישור לעסקה בתשלומים",
            "112" => "למסוף אין אישור לעסקה טלפון/ חתימה בלבד בתשלומים",
            "118" => "למסוף אין אישור לאשראי ישראקרדיט",
            "119" => "למסוף אין אישור לאשראי אמקס קרדיט",
            "124" => "למסוף אין אישור לאשראי ישרא 36.",
            "125" => "למסוף אין אישור לאשראי אמקס 36",
            "128" => "למסוף אין אישור לקבל כרטיסי ויזה אשר מתחילים ב - 3",
            "129" => "למסוף אין אישור לבצע עסקת זכות מעל תקרה",
            "133" => "כרטיס לא תקף על פי רשימת כרטיסים תקפים של ישראכרט",
            "134" => "כרטיס לא תקין עפ”י הגדרת המערכת (VECTOR1 של ישראכרט)- מס' הספרות בכרטיס- שגוי",
            "136" => "הכרטיס שייך לקבוצת כרטיסים אשר אינה רשאית לבצע עסקאות עפ”י הגדרת המערכת (VECTOR20 של ויזה)",
            "137" => "קידומת הכרטיס (7 ספרות) לא תקפה על פי הגדרת המערכת (21VECTOR של דיינרס)",
            "138" => "כרטיס לא רשאי לבצע עסקאות בתשלומים על פי רשימת כרטיסים תקפים של ישראכרט",
            "139" => "מספר תשלומים גדול מידי על פי רשימת כרטיסים תקפים של ישראכרט",
            "140" => "כרטיסי ויזה ודיינרס לא רשאים לבצע עסקאות מועדון בתשלומים",
            "141" => "סידרת כרטיסים לא תקפה על פי הגדרת המערכת (VECTOR5 של ישראכרט)",
            "142" => "קוד שרות לא תקף על פי הגדרת המערכת (VECTOR6 של ישראכרט)",
            "150" => "אשראי לא מאושר לכרטיסי חיוב מיידי",
            "173" => "עסקה כפולה",
            "205" => "סכום העסקה חסר או אפס",
            "306" => "אין תקשורת לפלא-קארד",
            "500" => "סליקה כפולה - אסורה",
            "506" => "מספר טוקן לא תקין",
            "507" => "משתמש לא רשאי לבצע פעולות במסוף זה",
            "597" => "שגיאה כללית אנא פנה למחלקת התמיכה",
            "599" => "שגיאה כללית אנא פנה למחלקת התמיכה"
        ];

        return !empty($err[$reason]) ? $err[$reason] : '000';
    }
}
