<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Layouts Language Lines
    |--------------------------------------------------------------------------
    |
    |
    */

    'home' => 'Passwords must be at least six characters and match the confirmation.',
    'password' => 'סיסמה חייבת להיות לפחות 6 תווים',
    'reset' => 'סיסמתך אופסה, בדוק את תיבת המייל שלך!',
    'sent' => 'שלחנו לך במייל לינק לאיפוס הסיסמה!',
    'token' => 'אסימון לאיפוס סיסמה לא קיים.',
    'user' => "לא מצאנו משתמש עם כתובת המייל שהזנת.",

];
